app/controllers/articles_controller.rb

	def index
    articles = Article.all
---
SELECT "articles".* FROM "articles"

  def show
  	@article = Article.find(params[:id].to_i)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @article = Article.new(article_params.merge(author_id: session[:user_id]))

    if @article.save
---
INSERT INTO "articles" ("title", "start_date", "end_date", "content", "readings", "sub_title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"