app/controllers/comments_controller.rb

  def article_create
  	authorize!
    article = Article.find(params[:article_id])

  	@comment = article.comments.new(comment_params.merge(author_id: session[:user_id]))

  	if @comment.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "author_id", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def comment_create
    authorize!
    comment = Comment.find(params[:comment_id])

    @comment = comment.comments.new(comment_params.merge(author_id: session[:user_id]))

    if @comment.save
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "author_id", "commentable_id", "commentable_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def destroy
    @comment = Comment.find(params[:id])

    @comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 6]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 6]]