app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "alexwen.creates@gmail.com"]]
---
	def create
	  @user = User.find_by(username: user_params[:username])