app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "username", "email", "password_digest", "admin", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    p params["user"]["access_code"]
    if (params["user"]["access_code"] == "salmon")
      if @user.save